# Run with `brew bundle install`

tap "homebrew/cask-fonts" # Repository of fonts
brew "neofetch" # Display system info in terminal
brew "neovim" # Vim text editor
brew "node" # node.js / npm
brew "pyenv" # Python version management
brew "ripgrep" # Search tool like grep. Enables live grep for the Telescope Neovim plugin.
brew "tmux" # Terminal multiplexer
brew "fzf" # Command-line fuzzy finder
brew "zsh-autosuggestions" # Autosuggestions for zsh
brew "zsh-syntax-highlighting" # Syntax-highlighting for zsh
brew "awscli" # Official Amazon AWS command-line interface
brew "tpm" # Plugin manager for tmux
brew "ranger" # Command-line file browser
cask "appcleaner" # Application uninstaller
cask "brave-browser" # Web browser focusing on privacy
cask "font-hack-nerd-font" # Nice font
cask "font-jetbrains-mono-nerd-font" # Nice font
cask "font-symbols-only-nerd-font" # Add symbols-only font as fallback font symbols for kitty.
cask "iterm2" # Default Mac terminal alternative
cask "rectangle" # Move and resize windows with keyboard shortcuts
cask "vlc" # Video player
cask "dbeaver-community" # Universal database tool and SQL client
cask "docker" # Containerizing applications
cask "kitty" # GPU-based terminal emulator
cask "obsidian" # Note-taking app
cask "spotify" # Music
cask "grammarly-desktop" # Utility to fix grammar errors and style issues in text
cask "visual-studio-code" # Code editor

