# Sources
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
# CLI
# Note: Lots of tools are added with .zsh_plugins.txt through antidote
brew "bat"
brew "coreutils"
brew "eza" # Modern, maintained replacement for ls
brew "fzf"
brew "git"
brew "gnu-tar" # Provides the ability to tar files
brew "openjdk"
brew "jenv"
brew "mvnvm"
brew "node"
brew "poetry"
brew "pre-commit"
brew "ranger"
brew "ripgrep"
brew "speedtest-cli"
brew "starship" # Zsh theme
brew "terminal-notifier"
brew "thefuck"
brew "tldr"
brew "tree" # Adds the 'tree' cli command
brew "vim"
brew "virtualenvwrapper"
brew "wakeonlan" # Only if still using LG C1
brew "ykman" # Yubikey CLI
brew "zoxide" # Better cd
brew "zsh-autosuggestions"
brew "mas"
# Applications
cask "aerospace"
cask "alfred"
cask "betterdisplay"
cask "bitwarden"
cask "caffeine"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "grammarly"
cask "insomnia"
cask "iterm2"
cask "jordanbaird-ice"
cask "logi-options+"
cask "maccy"
cask "notion"
cask "plex"
cask "shortcat" # App that enables mouse-free UI interaction. Cmd + shift + space
cask "spotify"
cask "tailscale"
cask "visual-studio-code"
cask "wezterm"
cask "whatsapp"
cask "zoom"
# Mac app store
mas "Keynote", id: 409183694
mas "Trello", id: 1278508951
# VS Code Extensions
vscode "csantiago132.intellij-ish-darcula-theme"
vscode "ecmel.vscode-html-css"
vscode "k--kato.intellij-idea-keybindings"
vscode "kevinrose.vsc-python-indent"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "redhat.java"
vscode "tamasfe.even-better-toml"
vscode "vintharas.learn-vim"
vscode "vscodevim.vim"
vscode "zainchen.json"
